과목평가는 자료랑 실습실 뺑뺑이쳐라!
월말평가는 예시문제마냥 내가 직접 코딩해야하는게 많이 나온다.
무조건 ~~ 쓰세요!!! 이런건 아니니까 알아서 쓰지말라는거만 피해서 잘 만들어 보라..

리스트 : 반복문 수행, 요소가 숫자, 문자열, 리스트, 딕셔너리 다 있다.
[[1,2,3,4],[3,4,5],[5,10,2,3,4]] 중첩 반복문  얘들 총합 행별 총합 구하세요 같은것들
[
       {'name' : '김싸피', 'score' : 100, 'school' ; 'gumi'}, 
       {'name' : '김싸피', 'score' : 100, 'school' ; 'seoul'},
        {'name' : '김싸피', 'score' : 100, 'school' ; 'seoul'},
       {'name' : '김싸피', 'score' : 100, 'school' ; 'gumi'},

] 4명 이름 추출하세요 / 총 점수 뽑아보세요 / 같은 지역 뽑아보세요/ 슬라이싱해보자

딕셔너리 안에 리스트 등 중첩된 자료에서 내가 원하는 데이터 뽑아서 반복 도는 연습!

for el in lst:, for i in ragne(N):
 
딕셔너리
set
문자열 이거 잘 봐라 ㅋㅋ

과목 : 30문제 이상
월말 : 10문제 이내내